---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomNumber
source: html/1fbc8f2a-4e40-bc86-9bf1-5833143fbe11.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomNumber Property

"Number"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomNumber { get; }
```